git init - .git, создает папку, в которой содержится все необходимые файлы.
git remote add nameurl(HTTPS,SSH) добавляет удаленный репозиторий.
git pull origin master - стягивает изменения из мастера.
it status - показывает статус файла проектов.
git add - добавляет файлы в рабочей папки, в индекс.
git add name - добавляет только указанный файл.
git . - добавляет все измененные файлы.
git commit - добавляет все файлы в индексе во внутренюю базу данных, и сдвигеает
текущую ветку в эту базу данных.
git commit -m "commet" - для описания нашего коммита.
git branch - менеджер веток, и для выбора из них.
git branch namebranch - для создания  новой ветки с указанным именем.
git push namebranch - для отправки, в удаленный репозиторий.
git push origin master/
git checkout namebranch - переключает в ветку с указанным именем.
git reset filename - удаляет файл из индекса с указанным именем.

